#Использовать fs

Функция ПрочитатьФайлВТекст(ИмяФайла) Экспорт
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Возврат Текст;
КонецФункции

Процедура ЗаписатьТекстВФайл(ИмяФайла, Текст, Знач Кодировка = Неопределено) Экспорт
	
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;

	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, Кодировка);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

Процедура ПодготовитьФайлКЗаписи(ИмяФайла) Экспорт

	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	ФС.ОбеспечитьКаталог(Файл.Путь);

	ЗаписатьТекстВФайл(ИмяФайла, "Тест прав на запись файла и на валидность имени");
	УдалитьФайлы(ИмяФайла);

КонецПроцедуры